# Numpy_CheatSheet

In [4]:
import pandas as pd
import numpy as np

In [11]:
d = pd.DataFrame({
    'key1' : ['a', 'a', 'b', 'b', 'a'],
    'key2' : ['one', 'two', 'one', 'two', 'one'],
    'data1' : np.random.randn(5),
    'data2' : np.random.randn(5)
})
d

  key1 key2     data1     data2
0    a  one -1.427562 -0.818887
1    a  two  1.123391  0.904921
2    b  one  0.705890  0.267842
3    b  two  0.494547 -0.753993
4    a  one  2.307786 -2.255880

In [26]:
d.groupby(['key1']).mean()

         data1     data2
key1
a     0.667872 -0.723282
b     0.600218 -0.243076

In [14]:
d.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.440112 -1.537384
     two   1.123391  0.904921
b    one   0.705890  0.267842
     two   0.494547 -0.753993

### 统计函数
- mean()
- count()
- std()
- min()
- max()

In [18]:
d.std() #标准差

data1    1.352358
data2    1.204972
dtype: float64

### 统计列不同的个数

In [22]:
d.groupby(['key1']).count()

      key2  data1  data2
key1
a        3      3      3
b        2      2      2

### 排序问题

In [36]:
d.sort_values(by = ['data2', 'data1']) # 升序

  key1 key2     data1     data2
4    a  one  2.307786 -2.255880
0    a  one -1.427562 -0.818887
3    b  two  0.494547 -0.753993
2    b  one  0.705890  0.267842
1    a  two  1.123391  0.904921

In [37]:
d.sort_values(by = ['data1'], ascending = False) # 降序

  key1 key2     data1     data2
4    a  one  2.307786 -2.255880
1    a  two  1.123391  0.904921
2    b  one  0.705890  0.267842
3    b  two  0.494547 -0.753993
0    a  one -1.427562 -0.818887